Cas_1a/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Cavité haute
    (0.045 0.1 0)
    (0.055 0.1 0)
    (0.055 0.11 0)
    (0.045 0.11 0)

    (0.045 0.1 0.01)
    (0.055 0.1 0.01)
    (0.055 0.11 0.01)
    (0.045 0.11 0.01)

    // Cavité basse
    (0 0 0)
    (0.1 0 0)
    (0.1 0.1 0)
    (0 0.1 0)

    (0 0 0.01)
    (0.1 0 0.01)
    (0.1 0.1 0.01)
    (0 0.1 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (13 13 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (128 128 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (8 12 13 9)
            (9 13 14 10)
            //(10 14 5 1)
            (10 14 15 11)
            (1 5 6 2)
            (3 7 4 0)
            //(0 4 15 11)
            (11 15 12 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (8 9 10 11)
            (12 13 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
